TjRichmond/chess-timer-sw/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_max7219.h
/**
 * @file    max7219.h
 * @brief   Header for stm32u0xx_hal_max7219.h file
 *          This file constains the common defines of the max7219 IC.
 */
#ifndef STM32U0xx_HAL_MAX7219_H
#define STM32U0xx_HAL_MAX7219_H

#ifdef __cplusplus
extern "C" {
#endif
#include "stm32u0xx_hal.h"

/**
 * @brief   max7219 8-diget LED Display Driver
 */
typedef struct
{
  GPIO_TypeDef  *CSPort;
  uint16_t  CSPin;
  SPI_HandleTypeDef *hspi;
} MAX7219_InitTypeDef;

/**
 * @brief   HAL MAX7219 address structure definition
 */
typedef enum
{
  HAL_MAX7219_ADDRESS_NO_OP = 0x00,
  HAL_MAX7219_ADDRESS_DIGIT_0 = 0x01,
  HAL_MAX7219_ADDRESS_DIGIT_1 = 0x02,
  HAL_MAX7219_ADDRESS_DIGIT_2 = 0x03,
  HAL_MAX7219_ADDRESS_DIGIT_3 = 0x04,
  HAL_MAX7219_ADDRESS_DIGIT_4 = 0x05,
  HAL_MAX7219_ADDRESS_DIGIT_5 = 0x06,
  HAL_MAX7219_ADDRESS_DIGIT_6 = 0x07,
  HAL_MAX7219_ADDRESS_DIGIT_7 = 0x08,
  HAL_MAX7219_ADDRESS_DECODE_MODE = 0x09,
  HAL_MAX7219_ADDRESS_INTENSITY = 0x0A,
  HAL_MAX7219_ADDRESS_SCAN_LIMIT = 0x0B,
  HAL_MAX7219_ADDRESS_SHUTDOWN = 0x0C,
  HAL_MAX7219_ADDRESS_DISPLAY_TEST = 0x0F,
} HAL_MAX7219_AddressTypeDef;

/**
 * @brief   HAL MAX7219 command structure definition
 */
typedef enum
{
  HAL_MAX7219_COMMAND_SHUTDOWN_MODE = 0x00,
  HAL_MAX7219_COMMAND_NORMAL_OPERATION = 0x01,
  HAL_MAX7219_COMMAND_NO_DECODE = 0x00,
  HAL_MAX7219_COMMAND_CODE_B_DIGIT_0 = 0x01,
  HAL_MAX7219_COMMAND_CODE_B_DIGIT_3_0 = 0x0F,
  HAL_MAX7219_COMMAND_CODE_B_DIGIT_7_0 = 0xFF,
  HAL_MAX7219_COMMAND_CODE_B_FONT_0 = 0x00,
  HAL_MAX7219_COMMAND_CODE_B_FONT_1 = 0x01,
  HAL_MAX7219_COMMAND_CODE_B_FONT_2 = 0x02,
  HAL_MAX7219_COMMAND_CODE_B_FONT_3 = 0x03,
  HAL_MAX7219_COMMAND_CODE_B_FONT_4 = 0x04,
  HAL_MAX7219_COMMAND_CODE_B_FONT_5 = 0x05,
  HAL_MAX7219_COMMAND_CODE_B_FONT_6 = 0x06,
  HAL_MAX7219_COMMAND_CODE_B_FONT_7 = 0x07,
  HAL_MAX7219_COMMAND_CODE_B_FONT_8 = 0x08,
  HAL_MAX7219_COMMAND_CODE_B_FONT_9 = 0x09,
  HAL_MAX7219_COMMAND_CODE_B_FONT_DASH = 0x0A,
  HAL_MAX7219_COMMAND_CODE_B_FONT_E = 0x0B,
  HAL_MAX7219_COMMAND_CODE_B_FONT_H = 0x0C,
  HAL_MAX7219_COMMAND_CODE_B_FONT_L = 0x0D,
  HAL_MAX7219_COMMAND_CODE_B_FONT_P = 0x0E,
  HAL_MAX7219_COMMAND_CODE_B_FONT_BLANK = 0x0F,
  HAL_MAX7219_COMMAND_CODE_B_FONT_DP = 0x10,
  HAL_MAX7219_COMMAND_INTENSITY_0 = 0x00,
  HAL_MAX7219_COMMAND_INTENSITY_1 = 0x01,
  HAL_MAX7219_COMMAND_INTENSITY_2 = 0x02,
  HAL_MAX7219_COMMAND_INTENSITY_3 = 0x03,
  HAL_MAX7219_COMMAND_INTENSITY_4 = 0x04,
  HAL_MAX7219_COMMAND_INTENSITY_5 = 0x05,
  HAL_MAX7219_COMMAND_INTENSITY_6 = 0x06,
  HAL_MAX7219_COMMAND_INTENSITY_7 = 0x07,
  HAL_MAX7219_COMMAND_INTENSITY_8 = 0x08,
  HAL_MAX7219_COMMAND_INTENSITY_9 = 0x09,
  HAL_MAX7219_COMMAND_INTENSITY_10 = 0x0A,
  HAL_MAX7219_COMMAND_INTENSITY_11 = 0x0B,
  HAL_MAX7219_COMMAND_INTENSITY_12 = 0x0C,
  HAL_MAX7219_COMMAND_INTENSITY_13 = 0x0D,
  HAL_MAX7219_COMMAND_INTENSITY_14 = 0x0E,
  HAL_MAX7219_COMMAND_INTENSITY_15 = 0x0F,
  HAL_MAX7219_COMMAND_INTENSITY_MIN = HAL_MAX7219_COMMAND_INTENSITY_0,
  HAL_MAX7219_COMMAND_INTENSITY_MAX = HAL_MAX7219_COMMAND_INTENSITY_15,
  HAL_MAX7219_COMMAND_SCAN_0 = 0x00,
  HAL_MAX7219_COMMAND_SCAN_1_0 = 0x01,
  HAL_MAX7219_COMMAND_SCAN_2_0 = 0x02,
  HAL_MAX7219_COMMAND_SCAN_3_0 = 0x03,
  HAL_MAX7219_COMMAND_SCAN_4_0 = 0x04,
  HAL_MAX7219_COMMAND_SCAN_5_0 = 0x05,
  HAL_MAX7219_COMMAND_SCAN_6_0 = 0x06,
  HAL_MAX7219_COMMAND_SCAN_7_0 = 0x07,
  HAL_MAX7219_COMMAND_TEST_DISABLE = 0x00,
  HAL_MAX7219_COMMAND_TEST_ENABLE = 0x01,
} HAL_MAX7219_CommandTypeDef;

/**
 * @brief   MAX7219 handle Structure definition
 */
typedef struct __MAX7219_HandleTypeDef
{
  MAX7219_InitTypeDef Init;
} MAX7219_HandleTypeDef;

HAL_StatusTypeDef HAL_MAX7219_Init(
  MAX7219_HandleTypeDef *hmax7219
);

HAL_StatusTypeDef HAL_MAX7219_SendMessage(
    MAX7219_HandleTypeDef *hmax7219,
    HAL_MAX7219_AddressTypeDef addr,
    HAL_MAX7219_CommandTypeDef cmd);

#ifdef __cplusplus
}
#endif

#endif /* STM32U0xx_HAL_GPIO_H */